app/views/topics/index.html.erb

           <%= image_tag topic.image.url %>
           <% if !topic.favorite_users.include?(current_user) %>
---
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2)

           <% end %>
           <%= topic.favorites.count %>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`topic_id` = 1

           <ul>
            <% topic.comments.each do |comment| %>
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`topic_id` = 1 LIMIT 1