app/controllers/favorites_controller.rb

  def create
    @favorite = Favorite.new(user_id: current_user.id, topic_id: params[:topic_id])
    if @favorite.save
---
INSERT INTO `favorites` (`user_id`, `topic_id`, `created_at`, `updated_at`) VALUES (1, 3, '2018-12-11 10:13:36', '2018-12-11 10:13:36')

  def destroy
    @favorite = Favorite.find_by(user_id: current_user.id,topic_id: params[:topic_id])
    @favorite.destroy
---
SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 1 AND `favorites`.`topic_id` = 2 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 1