app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'asteriskdanmach@yahoo.co.jp' LIMIT 1
---
  def create
    user = User.find_by(email: sessions_params[:email])