app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics`
---
  def index
    @topics = Topic.all.includes([:favorite_users, :comment_users])

INSERT INTO `topics` (`user_id`, `description`, `image`, `created_at`, `updated_at`) VALUES (1, '投稿', 'bg-top__2_.jpg', '2018-12-11 15:43:16', '2018-12-11 15:43:16')
---
  def create
    @topic = current_user.topics.new(topic_params)

  if @topic.save

INSERT INTO `comments` (`comment`, `user_id`, `topic_id`, `created_at`, `updated_at`) VALUES ('ああああああああああ', 1, 1, '2018-12-12 06:41:07', '2018-12-12 06:41:07')
---
 def comment
   @comment = Comment.new(comment: params[:comment], topic_id: params[:topic_id], user_id: params[:user_id])
   @comment.save